{
    "name": "Orbeck",
    "ability_scores": [ 8, 15, 14, 15, 10, 8],
    "hit_dice": [
        10,
        6,
        6,
        6,
        6,
        6
    ],
    "level": 8,
    "background": {
        "name": "Spy",
        "description": "You are an experienced criminal with a history of breaking the law. You have spent a lot of time among other criminals and still have contacts within the criminal underworld. You're far closer than most people to the world of murder, theft, and violence that pervades the underbelly of civilization, and you have survived up to this point by flouting the rules and regulations of society.",
        "features": [
            {
                "name": "Skill Proficiencies",
                "proficiencies": [
                    "Arcana",
                    "Insight",
                    "Dragonchess Set",
                    "Poisoner's Kit"
                ]
            },
            {
                "name": "Background Feat",
                "type": "feat",
                "feat": {
                    "name": "Tough"
                }
            },
            {
                "type": "asi",
                "asi": {
                    "int": 3
                }
            }
        ]
    },
    "class": [
        {
            "name": "Rogue",
            "level": 1,
            "features": [
                {
                    "name": "Core Rogue Traits",
                    "proficiencies": [
                        "Sleight of Hand",
                        "Deception",
                        "Perception",
                        "Stealth",
                        "Theives' Tools",
                        "Dexterity Saving Throws",
                        "Intelligence Saving Throws"
                    ]
                },
                {
                    "name": "Expertise",
                    "level": 1,
                    "expertise": [
                        "Perception",
                        "Stealth"
                    ]
                },
                {
                    "name": "Sneak Attack",
                    "level": 1
                },
                {
                    "name": "Thieves' Cant",
                    "level": 1
                },
                {
                    "name": "Weapon Mastery",
                    "level": 1
                }
            ]
        },
        {
            "name": "Wizard",
            "level": 7,
            "features": [
                {
                    "name": "Spellcasting",
                    "description": [
                        "As a student of arcane magic, you have learned to cast spells.",
                        "Cantrips. You know three Wizard cantrips of your choice. Whenever you finish a Long Rest, you can replace one of your cantrips from this feature with another Wizard cantrip of your choice.",
                        "When you reach Wizard levels 4 and 10, you learn another Wizard cantrip of your choice, as shown in the Cantrips column of the Wizard Features table.",
                        "Spellbook. Your wizardly apprenticeship culminated in the creation of a unique book: your spellbook. It is a Tiny object that weighs 3 pounds, contains 100 pages, and can be read only by you or someone casting Identify. You determine the book’s appearance and materials, such as a gilt-edged tome or a collection of vellum bound with twine.",
                        "The book contains the level 1+ spells you know. It starts with six level 1 Wizard spells of your choice.",
                        "Whenever you gain a Wizard level after 1, add two Wizard spells of your choice to your spellbook. Each of these spells must be of a level for which you have spell slots, as shown in the Wizard Features table. The spells are the culmination of arcane research you do regularly.",
                        "Spell Slots. The Wizard Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
                        "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To do so, choose four spells from your spellbook. The chosen spells must be of a level for which you have spell slots.",
                        "The number of spells on your list increases as you gain Wizard levels, as shown in the Prepared Spells column of the Wizard Features table. Whenever that number increases, choose additional Wizard spells until the number of spells on your list matches the number in the table. The chosen spells must be of a level for which you have spell slots. For example, if you’re a level 3 Wizard, your list of prepared spells can include six spells of levels 1 and 2 in any combination, chosen from your spellbook.",
                        "If another Wizard feature gives you spells that you always have prepared, those spells don’t count against the number of spells you can prepare with this feature, but those spells otherwise count as Wizard spells for you.",
                        "Changing Your Prepared Spells. Whenever you finish a Long Rest, you can change your list of prepared spells, replacing any of the spells there with spells from your spellbook.",
                        "Spellcasting Ability. Intelligence is your spellcasting ability for your Wizard spells.",
                        "Spellcasting Focus. You can use an Arcane Focus or your spellbook as a Spellcasting Focus for your Wizard spells."
                    ],
                    "level": 1,
                    "spells": [
                        ["XPHB", "Blade Ward", true],
                        ["TCE",  "Booming Blade", true],
                        ["TCE",  "Lightning Lure", true],
                        ["XPHB", "True Strike", true],
                        ["XPHB", "Absorb Elements", false],
                        ["XPHB", "Alarm", false],
                        ["XPHB", "Charm Person", false],
                        ["XPHB", "Chromatic Orb", false],
                        ["XPHB", "Comprehend Languages", false],
                        ["XPHB", "Detect Magic", false],
                        ["XPHB", "Disguise Self", true],
                        ["XPHB", "False Life", false],
                        ["XPHB", "Feather Fall", false],
                        ["XPHB", "Find Familiar", false],
                        ["XPHB", "Ice Knife", true],
                        ["XPHB", "Identify", false],
                        ["XPHB", "Mage Armor", true],
                        ["XPHB", "Magic Missile"],
                        ["XPHB", "Shield", true],
                        ["XPHB", "Silvery Barbs", true],
                        ["XPHB", "Sleep", false],
                        ["XPHB", "Thunderwave", false],
                        ["XPHB", "Unseen Servant", false],
                        ["XPHB", "Cloud of Daggers", false],
                        ["XPHB", "Mirror Image", true],
                        ["XPHB", "Misty Step", true],
                        ["XPHB", "Rope Trick", false],
                        ["XGE",  "Shadow Blade", true],
                        ["XPHB", "Shatter", false],
                        ["XPHB", "Fireball", false],
                        ["XPHB", "Lightning Bolt", true],
                        ["XPHB", "Thunder Step", false],
                        ["XPHB", "Charm Monster", false]
                    ],
                    "spellcasting_ability": 3
                },
                {
                    "name": "Ritual Adept",
                    "level": 1
                },
                {
                    "name": "Arcane Recovery",
                    "level": 1
                },
                {
                    "name": "Scholar",
                    "level": 2,
                    "expertise": [
                        "Deception"
                    ]
                },
                {
                    "name": "Bladesong",
                    "level": 3
                },
                {
                    "name": "Training in War and Song",
                    "level": 3,
                    "proficiencies": [
                        "Persuasion"
                    ]
                },
                {
                    "type": "asi",
                    "asi": {
                        "int": 1
                    }
                },
                {
                    "name": "Ability Score Improvement",
                    "level": 4,
                    "feat": {
                        "name": "Shadow Touched",
                        "spells": [
                            ["XPHB", "Invisibility", true],
                            ["XPHB", "Wrathful Smite", true]
                        ],
                        "spellcasting_ability": 3,
                        "asi": {
                            "int": 1
                        }
                    }
                },
                {
                    "name": "Memorize Spell",
                    "level": 5
                }
            ]
        }
    ],
    "equipment": [
        {
            "type": "melee_weapon",
            "name": "Shadow Blade",
            "damage": [
                {
                    "dice": "d8",
                    "num": "2"
                },
                {
                    "dice": "d8",
                    "num": "3"
                }
            ],
            "damage_type": "Psychic",
            "properties": [
                "Finesse",
                "Light"
            ]
        },
        {
            "type": "melee_weapon",
            "name": "Scimitar, +1",
            "damage": [
                {
                    "dice": "d6",
                    "num": "1"
                }
            ],
            "damage_type": "Slashing",
            "properties": [
                "Finesse",
                "Light",
                "Nick",
                "+1"
            ]
        },
        {
            "type": "melee_weapon",
            "name": "Dagger, +1",
            "damage": [
                {
                    "dice": "d4",
                    "num": "1"
                }
            ],
            "damage_type": "Slashing",
            "properties": [
                "Finesse",
                "Light",
                "Nick",
                "Thrown",
                "+1"
            ]
        },
        {
            "type": "item",
            "name": "Gloves of Theivery",
            "features": [
                {
                    "bonus": [
                        {
                            "ability": "Sleight of Hand",
                            "bonus": 5
                        }
                    ]
                }
            ]
        }
    ],
    "inventory": {
        "equipment": [
            
        ],
        "backpack": [
            
        ]
    },
    "features": [
        
    ],
    "species": {
        "name": "Hobgoblin",
        "description": [
            "Hobgoblins trace their origins to the ancient courts of the Feywild, where they first appeared with their goblin and bugbear kin. Many of them were driven from the Feywild by the conquering god Maglubiyet, who marshaled them as soldiers, but the fey realm left its mark; wherever they are in the multiverse, they continue to channel an aspect of the Feywild's rule of reciprocity, which creates a mystical bond between the giver and the receiver of a gift.",
            "On some worlds, such bonds lead hobgoblins to form communities with deep ties to one another. In Eberron and the Forgotten Realms, vast hobgoblin legions have emerged, with ranks of devoted soldiers famed for their unity.",
            "Hobgoblins are generally taller than their goblin cousins but not quite as big as bugbears. They have curved, pointed ears and noses that turn bright red or blue during displays of emotion."
        ],
        "walking_speed": 30,
        "features": [
            {
                "name": "Creature Type",
                "description": "You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid.",
                "modifiers": [

                ]
            },
            {
                "name": "Darkvision",
                "description": "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.",
                "modifiers": [
                    {
                        "type": "sense",
                        "sense": {
                            "name": "Darkvision",
                            "range": 60
                        }
                    }
                ]
            },
            {
                "name": "Fey Ancestry",
                "description": "You have advantage on saving throws you make to avoid or end the charmed condition on yourself.",
                "modifiers": [
                    {
                        "type": "advantage",
                        "advantage": [
                            {
                                "type": "save",
                                "save": {
                                    "condition": "Charmed"
                                }
                            }
                        ]
                    }
                ]
            },
            {
                "name": "Fey Gift",
                "description": [
                    "You can use this trait to take the Help action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.",
                    "Starting at 3rd level, choose one of the options below each time you take the Help action with this trait:"
                ],
                "features": [
                    {
                        "name": "Hospitality",
                        "description": "You and the creature you help each gain a number of temporary hit points equal to 1d6 plus your proficiency bonus."
                    },
                    {
                        "name": "Passage",
                        "description": "You and the creature you help each increase your walking speeds by 10 feet until the start of your next turn."
                    },
                    {
                        "name": "Spite",
                        "description": "Until the start of your next turn, the first time the creature you help hits a target with an attack roll, that target has disadvantage on the next attack roll it makes within the next minute."
                    }
                ]
            },
            {
                "name": "Fortune from the Many",
                "description": "If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +3). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.",
                "modifiers": [

                ]
            },
            {
                "name": "Languages",
                "description": "You can speak, read, and write Common and one other language that you and your DM agree is appropriate for your character.",
                "modifiers": [

                ]
            }
        ]
    }
}