{
	"spell": [
		{
			"name": "Pacify Person",
			"source": "OTTG",
			"page": 187,
			"level": 1,
			"school": "E",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 60
				}
			},
			"components": {
				"v": true,
				"s": true,
				"m": "a gull's feather"
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "minute",
						"amount": 1
					},
					"concentration": true
				}
			],
			"entries": [
				"You attempt to pacify a humanoid you can see within range. The target must make a Wisdom saving throw. If it fails the save, it is pacified by you until the spell ends. A pacified creature can't attack, cast a spell that affects an enemy, or deal damage to another creature. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
			],
			"entriesHigherLevel": [
				{
					"type": "entries",
					"name": "At Higher Levels",
					"entries": [
						"When you cast this spell using a spell slot of 2nd level or higher, you can target one additional humanoid for each slot level above 1st. The humanoids must be within 30 feet of each other when you target them."
					]
				}
			]
		},
		{
			"name": "Retrieve",
			"source": "OTTG",
			"page": 188,
			"level": 0,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "bonus"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 15
				}
			},
			"components": {
				"v": true
			},
			"duration": [
				{
					"type": "instant"
				}
			],
			"entries": [
				"You cause an object within range that isn't being worn or carried to fly to your open hand. The object must weigh no more than 10 pounds or the spell fails."
			]
		},
		{
			"name": "Task",
			"source": "OTTG",
			"page": 191,
			"level": 0,
			"school": "T",
			"time": [
				{
					"number": 1,
					"unit": "action"
				}
			],
			"range": {
				"type": "point",
				"distance": {
					"type": "feet",
					"amount": 15
				}
			},
			"components": {
				"s": true
			},
			"duration": [
				{
					"type": "timed",
					"duration": {
						"type": "hour",
						"amount": 1
					}
				}
			],
			"entries": [
				"With a flick of your wrist, you magically complete a small and simple task, such as flipping a book page, buttering bread, or heating a cup of tea, without any physical interaction. The task can't include anything that is intended to inflict a harmful effect on a creature and must be something you'd normally be able to accomplish without the use of magic. The spell fails if the target of the task has total cover from you.",
				"If you cast this spell multiple times, you can have up to three tasks active at a time, and you can dismiss one of them as a bonus action."
			]
		}
	]
}
